{
  "data": {
    "baZi": "己巳 丙子 丙寅 戊子",
    "daYunYear": [
      "丁丑(1991-2000)",
      "戊寅(2001-2010)",
      "己卯(2011-2020)",
      "庚辰(2021-2030)",
      "辛巳(2031-2040)",
      "壬午(2041-2050)",
      "癸未(2051-2060)",
      "甲申(2061-2070)"
    ],
    "daYun": [
      {
        "year": "2011—2020己卯大运",
        "score": 79,
        "text": "此十年的大运较旺，诸事平顺，幸福安康，也是创业兴家，名利双收，春风得意的运程，即使有小的曲折和不如意，也无大碍，会很快被你克服并战胜困难。多数时间个人能力可得到不错的发挥，理想总能基本实现，甚至还有意想不到的好事降临，朋友亲人得力，财丁兴旺，贵人机遇也时常出现，只要积极主动，善于把握机会，努力争取，定会科甲连登，家业丰裕，功名显赫，感情婚姻和家庭方面亦融洽和谐。是个人成长较快、生活幸福愉快的大运。如遇流年有利晴天顺风时，则会好上加好，能更上一个台阶；遇到流年不吉阴天逆风时，防止突变和吉事成凶压力倍增，但困难往往只是短暂的，努力克服很快即能时来运转，各种车型的命格在此运中均能发挥不错，找到属于自己的成就。但要注意不要出现路陷及合化凶神的现象，出现任何一种好运气都会大打折扣。",
        "qiLuo": "本十年大运中您的整体运程走势为：低开高走\n前为土路（五分之一）：为中等偏差的运程，发展会缓慢辛苦，行事小心谨慎为妙，不宜投资多动；家庭健康皆易有不稳定信息，收获不大，付出较多，避免大的冒险，事业发展过快反易招破耗，喜有合化吉神或凶神受伤的情况出现，则可转危为安，逢事遇贵，否则在只能处处谨慎，等待时机。\n后为快速路（五分之四）：为次吉之运程，道路也多畅通无阻，行运吉祥顺利，对何种车型来讲均有吉的一面体现出来，路途中出现的吉凶神煞不利的信息也会降低，发展速度较常人偏快，关键时刻还会多得贵人相助，是功名有成，财富丰隆的路程，多加努力定可有所做为。",
        "shiShen": "伤官:本十年大运前期为伤官运！多思想灵活，无所顾忌，贪图享乐，人际关系较广，但易判断失误而产生错误投资或逞强好胜而招惹是非，女性逢此运多不利婚姻感情，未婚者桃花难开，已婚者感情危机；男性逢此运程多自以为是，思想膨胀，好思考，好创造，好表现，想象力丰富，易在宗教、艺术、演艺界有所收获。大运得分较低时，付出较多，做事常常违反原则，不服管束，不安于现状，个性放荡，甚至有犯罪意识，有时会不顾法律有破坏伦理道德的行为发生，青少年时期最怕遇到此步运程；如大运得分高时，往往会大展才华，得机遇发偏财，异路功名成就超越众人。/n正印:本十年大运的中后期为正印运！此运程中多注意自己的修养，心慈好善，乐于助人，思想保守，多静少动，易在功名学业方面有所成，或有添屋进产之喜，大运得分高时，易受到长辈、领导的提携，遇到强有力的靠山而事业进步有成，会受到他人的欢迎和尊重，在功名事业上会有所成就；如大运得分较低，则生活多会辛苦劳累，烦恼较多，压力偏大，思虑过多往往难以实现，行动力不足，错失良机，才华被掩盖难以发挥，并不旺子女后代，求子困难。",
        "chongHe": "无"
      },
      {
        "year": "2021—2030庚辰大运",
        "score": 53,
        "text": "此十年的大运中等一般，运势平平，能力才华难以充分发挥，但至少可一分耕耘一分收获，多劳多得，不可心存幻想好高骛远，踏实基础，积累经验是最关键的。感情婚姻较平淡，应懂得珍惜。财运起伏明显，适合不动产的投资，比如买房买地等，风险过大的投资尽量避免。遇到好流年晴天顺风时，会有不错的收获，功名事业也可小成，健康无忧；遇到不利流年阴天逆风时，防止突变，各方面困难会加重，健康、家庭均要谨慎小心。整体来讲这十年属吉凶参半的运程，学会如何趋吉避凶将会给你带来很大帮助，同时要保持好心态。如是货车行些运，会比往年进步明显；如是越野车、跑车，则只能算中等偏下的运程，更大发展需待时机。",
        "qiLuo": "本十年大运中您的整体运程走势为：低开平走\n前为烂泥路（五分之二）：为最不理想的运程道路，凡事要低调谨慎，在此路途之中，任何车型的命局均宜静不宜动，避免大的投资和举动，目标不好太高，如再无合化吉神或凶神受伤的情况出现，则要防事非、病伤等诸多不吉之事，事业学业发展艰辛难有大的成绩，再遇阴天逆风严重时，往往会雪上加霜、祸不单行。\n后为土路（五分之三）：为中等偏差的运程，发展会缓慢辛苦，行事小心谨慎为妙，不宜投资多动；家庭健康皆易有不稳定信息，收获不大，付出较多，避免大的冒险，事业发展过快反易招破耗，喜有合化吉神或凶神受伤的情况出现，则可转危为安，逢事遇贵，否则在只能处处谨慎，等待时机。",
        "shiShen": "偏财:本十年大运前期为偏财运！儿童、少年行此运多得父亲的宠爱或溺爱，无忧无虑，幸福快乐，但易注意力不集中，幻想较多，常语出惊人，喜爱玩耍而不好学习，从而耽误学业；青少年及成年遇之，求财欲望会极为强烈，尤其对股票、彩票、黄金、期货等投机类极强的投资或赌博类生意十分着迷，投入较大的精力，执着心较强，不喜欢辛苦得财；但不一定都能发财，也难免会破财或因感情所累，大运打分较高时，则财源广进，事业有成；如得分较低，则可能会因机会把握不当或运气不佳而遭受损失，受财所困，生活压力变得相当沉重。男性容易异性缘增多，或多得异性相助，但也会受异性连累，容易沉溺于花天酒地之中。最不利正在求学之人，多会因常有贪图玩耍享受之心或恋爱之事，影响学业，造成学业下降；在名誉和形象方面也容易受到桃色传闻的影响或因心绪不佳而遭受损害；在此运程中亦有不利父母的信息，要多注意父母的身体健康，尤其是自己的母亲。/n食神:本十年大运的中后期为食神运！此运多为快乐幸福，注重感性而轻理性，喜投资进产而大利财运，性情温和厚道而多得人缘，不计较名利，不爱出风头，愿意付出，有爱心奉献的精神；愿意倾听各方面的意见，博采众家之所长，不专制；能力发挥卓越，但不愿做别人强迫的事，有独立工作的能力。如大运得分偏低，则不利发展，易错误投资而带来麻烦，好逸恶劳，体弱多病，付出较多回报较少，并且很容易损伤子息，不旺功名仕途，女性不利婚姻，感情难以称心。",
        "chongHe": "无"
      }
    ],
    "xingQing": "丙火之人一生求上进，正直刚强，不喜受他人的约束，感情丰富，积极乐观，活力充沛，待人处事彬彬有礼，富有同情心，会照顾人。\n人格宣言是：人之初，性本善。喜欢对事对物持有乐观的态度，看到一件开心高兴的小事，都会乐上半天，是一个开心冷却速度超级慢的人，而且事后无聊时还会把它想起来捧腹再乐一番，让人莫名其妙的不知所以然；\n爱憎分明，见到不公平之事，一定会出力相帮，打抱不平，做事比较冲动，有时会不分好坏，自己认为对的就是好的，就会支持，固执己见，脾气不佳，易冲动，往往属于一点就着的那种，让人即爱又恨，但又恨不起来，气来得快，消得也快，没记性。\n丙火的你多是一个不知何故而成为“焦点”人物的人，因为你的自尊心也比较强，所以最好不要做坏事，不然就会烦恼倍增。\n对待恋爱、婚姻感情方面，丙火的你往往是一个充满激情的人，浪漫的爱情故事是你最向往的，喜欢让另一半天天围绕着你转，听你的摆布，还要时刻关心着你，爱护着你，不能有一丝丝的冷却，真是让人心累的爱人啊，可是你自己对待感情的热度却是乎冷乎热的，用三分钟热度形容最为贴切。",
    "xiYong": "木 火 金 土 水",
    "wuXingLiLiang": "金:3% 木:13% 水:41% 火:22% 土:21%",
    "zuiXi": "十神:印枭 方位:正东 数字: 三、八 色彩:绿",
    "ciXi": "十神:比劫 方位:正南 数字: 二、七 色彩:红、紫",
    "zuiJi": "十神:财星 方位:正西 数字: 四、九 色彩:银、白",
    "ciJi": "十神:食伤 方位:本地、四偏方 数字: 五、零 色彩:黄",
    "pingChang": "十神:官杀 方位:正北 数字: 一、六 色彩:蓝、黑",
    "liuNian": [
      {
        "year": "2017火鸡年",
        "score": 78,
        "text": "今年是中吉之年，整体运程会有明显的正面变化，诸事顺利，感觉愉悦，在各个方面都能得到期待中的成绩，身边机会较多，可尝试新的投资，只要定好了目标，坚持努力就会有很好的成绩。若流年遇凶神，则要谨慎行事，谨防喜事成空。",
        "jiShen": "天乙贵人，是逢凶化吉之星，虽然力量偏弱，但有遇事呈祥，出门遇贵，吉运更吉，凶运减轻的作用，是很不错的一个星神。/n文昌星君，是专旺文学功名之星！出现则多思好学，科甲有望。利考学求功名，事业发展也会有所帮助，属小吉星力量不大，仅供参考！/n",
        "xiongShen": "合星小凶神，是不吉的信息，表示运程暗藏阻碍，会将吉事减弱或先成后败，即使是流年顺利也要多加注意，合作交友均需谨慎，如果是流年不吉更要小心谨慎，容易有损。/n白虎，小凶神，说明今年会有冲太岁的信息，因为是冲出了凶神，容易吉事成凶，逢冲多动，今年注意在动荡中出现不吉之事，注意小人和损耗，遇有远行、搬迁、调动、比赛等动荡之事谨慎为妙，但白虎也代表威严权贵，对于出兵打仗、武职仕途反而容易是好事。/n",
        "shiShenName": "劫财",
        "shiShenText": "流年劫财：务实、独立自强之人，交际能力不错，遇事常有很多朋友相助，财运较旺，若有志于事业亦能战胜困难获得成功。"
      },
      {
        "year": "2018土狗年",
        "score": 57,
        "text": "今年是中平小凶之年，总的来说凡事都会受到微小的阻力，不可过于乐观自信，要想成功必须付出十二分努力才行，凡事多靠自己，不可过于依赖别人的帮助。遇事可能有些不够明朗，需多加观察周边环境才可下决定。如有吉神出现，则喜事可期待。",
        "jiShen": "合星小吉神，是小吉的信息，对运程有正面的帮助，遇吉能锦上添花，遇凶能降低凶险，影响的力量虽不大，但总能雪中送炭，在危急关头助你一臂之力。/n",
        "xiongShen": "空亡，是喜也落空，忌也落空，变化无常之星！容易判断失误，注意力不集中，也表示某一时期或阶段心情或心态的失落，处于低谷而无法自拔。/n",
        "shiShenName": "食神",
        "shiShenText": "流年食神：事业上由于自己的疏忽以及竞争对手的出现，导致事业陷入层层困境之中，已婚女性夫妻之间感情不佳，争执吵闹之事不断。"
      },
      {
        "year": "2019土猪年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "合星小吉神，是小吉的信息，对运程有正面的帮助，遇吉能锦上添花，遇凶能降低凶险，影响的力量虽不大，但总能雪中送炭，在危急关头助你一臂之力。/n天乙贵人，是逢凶化吉之星，虽然力量偏弱，但有遇事呈祥，出门遇贵，吉运更吉，凶运减轻的作用，是很不错的一个星神。/n天德星，是小贵人之一，有吉运更吉，凶运减轻之作用，危难时易得贵人相助。/n",
        "xiongShen": "战星小凶神，说明当年易有动荡变化的信息，注意突发性伤病及破耗，避免冒险性活动。即使流年顺利也要防止由吉变凶，适当外出走动可降低命局的冲战，如果今年计划结婚、生子、合作等和合之事，要特别小心发生突变。/n今年生肖冲犯了太岁，因为太岁威严不可犯，撑管一年的生杀大权，生肖为八字的根基信息，多数人会有一定影响，往往容易运势受阻，诸事多磨。/n劫煞，是劫财、劫运、劫健康的意思，各方面好运气有所下降，诸事困难压力增大，注意口舌是非、伤病或破财之事发生。/n空亡，是喜也落空，忌也落空，变化无常之星！容易判断失误，注意力不集中，也表示某一时期或阶段心情或心态的失落，处于低谷而无法自拔。/n驿马，多主当年有动荡信息，多变化，流年好时有搬迁、旅游、升迁之事发生。流年不好时则难以安静，劳碌奔波，或者是背井离乡，一年中多动少静。/n",
        "shiShenName": "伤官",
        "shiShenText": "流年伤官：德艺双馨，亦擅辞令，机智聪敏，适合从事策划或自我创业等需创意的工作，财源较佳，感情方面有不错的进展，桃花挺旺。"
      },
      {
        "year": "2020金鼠年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "无",
        "xiongShen": "警车，说明流年与命局中出现了刑冲，要特别预防是非小人和官司口舌之类的事情缠身，也包括争斗车祸等突发事件，在生活中也尽量避免出现违法乱纪现象，否则容易招到刑罚带来不必要的烦恼。/n",
        "shiShenName": "偏财",
        "shiShenText": "流年偏财：兴趣方面喜欢研究新奇、非主流事物，工作事业感情都能顺顺利利，投机发财欲望亦能得到满意的结果，合作有利，心情愉悦。"
      },
      {
        "year": "2021金牛年",
        "score": 44,
        "text": "今年是偏凶之年，诸事都有多劳少得的倾向，需调整心态，面对现实，无论是工作还是感情，都不可期望过高，容易心情郁郁，凡事都务必低调求稳，以免招人暗算。若有吉神相助，则凡事都会朝着有利的方面发展，凶中带吉。",
        "jiShen": "无",
        "xiongShen": "合星小凶神，是不吉的信息，表示运程暗藏阻碍，会将吉事减弱或先成后败，即使是流年顺利也要多加注意，合作交友均需谨慎，如果是流年不吉更要小心谨慎，容易有损。/n",
        "shiShenName": "正财",
        "shiShenText": "流年正财：此年需多加谨慎，学业工作压力会增大，不利健康。求财艰辛，谨防因财惹祸，致心情不佳、名誉形象受损。感情方面付出多收获少，易为情所困。"
      },
      {
        "year": "2022水虎年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "月德星，是安祥福寿小吉星，有逢凶化吉，去灾招祥之作用，危难时易有贵人相助。因为力量有限，只能仅供参考，对流年命局影响起不到决定性作用。/n",
        "xiongShen": "今年生肖冲犯了太岁，因为太岁威严不可犯，撑管一年的生杀大权，生肖为八字的根基信息，多数人会有一定影响，往往容易运势受阻，诸事多磨。/n劫煞，是劫财、劫运、劫健康的意思，各方面好运气有所下降，诸事困难压力增大，注意口舌是非、伤病或破财之事发生。/n害星，是不吉之星，是凶险的信息。常表示小人是非出现，要特别注意小人坏事，吉事变凶。/n",
        "shiShenName": "偏官",
        "shiShenText": "流年偏官：感情方面出现转机，可能会成就一桩姻缘，事业发展也平顺，容易得上司提携，学业功名均有利，亦常得贵人相助。"
      },
      {
        "year": "2023水兔年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "合星小吉神，是小吉的信息，对运程有正面的帮助，遇吉能锦上添花，遇凶能降低凶险，影响的力量虽不大，但总能雪中送炭，在危急关头助你一臂之力。/n桃花，又称咸池，是魅力之星，在流年有利时会是感情丰富、多才多艺、能力发挥卓越、善交际的表现，可多处逢缘，易得异性相助，未婚者会有姻缘之喜，不要错失良机，已婚者防情感不专或烂桃花之事发生，易出现婚姻感情的波动。遇有流年不吉时则要防感情或婚姻带来的伤害，不利功名学业，甚至名誉形象会因为财色之事受到影响。/n",
        "xiongShen": "灾煞，又称白虎煞，其性勇猛，主血光伤人，在水火方面需防焚溺，在金木方面防杖刃之伤，在土方面防坠落瘟疫，再遇有流年不利更是较凶。/n警车，说明流年与命局中出现了刑冲，要特别预防是非小人和官司口舌之类的事情缠身，也包括争斗车祸等突发事件，在生活中也尽量避免出现违法乱纪现象，否则容易招到刑罚带来不必要的烦恼。/n",
        "shiShenName": "正官",
        "shiShenText": "流年正官：未婚的女性朋友，今年会有桃花运，工作上会得到同事和上司的帮助和提携，而且工作上会有升迁之喜，已婚女性夫妻之间感情幸福。"
      },
      {
        "year": "2024木龙年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "无",
        "xiongShen": "合星小凶神，是不吉的信息，表示运程暗藏阻碍，会将吉事减弱或先成后败，即使是流年顺利也要多加注意，合作交友均需谨慎，如果是流年不吉更要小心谨慎，容易有损。/n",
        "shiShenName": "偏印",
        "shiShenText": "流年偏印：本年中已经做出的计划基本能实现，平时多做善事，关键时刻亦能得贵人相助，工作姻缘方面皆能顺利，亦容易获功名。"
      },
      {
        "year": "2025木蛇年",
        "score": 64,
        "text": "今年是中平之年，大多是平淡度日，整体来讲暗藏了一些小的助力和好运气，虽然这种好运气很弱，但经过努力还是可以实现理想和目标，甚至还可以取得不错成绩。总的来讲今年运势较为明朗，凡事努力就会有回报，但不可抱有过高幻想，需脚踏实地，一分耕耘一分收获，工作事业方面容易有进步，心情愉悦。",
        "jiShen": "无",
        "xiongShen": "今年生肖冲犯了太岁，因为太岁威严不可犯，撑管一年的生杀大权，生肖为八字的根基信息，多数人会有一定影响，往往容易运势受阻，诸事多磨。/n害星，是不吉之星，是凶险的信息。常表示小人是非出现，要特别注意小人坏事，吉事变凶。/n",
        "shiShenName": "正印",
        "shiShenText": "流年正印：事业步入佳境，随之而来的名誉也会慢慢变好，钱财收入殷实，会有乔迁之喜，在家庭中与丈夫感情和合美满。"
      },
      {
        "year": "2026火马年",
        "score": 75,
        "text": "今年是小吉之年，整体运程较好，这样的流年会让你感觉诸事平顺，有贵人运，能得到提拔，只要自己多加努力，有望更上一个台阶，财运和感情也会有较好的发展，可以尝试进行一些投资或发展一段感情。但凡事谨慎为好，免得喜事暗藏凶事。",
        "jiShen": "合星小吉神，是小吉的信息，对运程有正面的帮助，遇吉能锦上添花，遇凶能降低凶险，影响的力量虽不大，但总能雪中送炭，在危急关头助你一臂之力。/n桃花，又称咸池，是魅力之星，在流年有利时会是感情丰富、多才多艺、能力发挥卓越、善交际的表现，可多处逢缘，易得异性相助，未婚者会有姻缘之喜，不要错失良机，已婚者防情感不专或烂桃花之事发生，易出现婚姻感情的波动。遇有流年不吉时则要防感情或婚姻带来的伤害，不利功名学业，甚至名誉形象会因为财色之事受到影响。/n",
        "xiongShen": "战星小凶神，说明当年易有动荡变化的信息，注意突发性伤病及破耗，避免冒险性活动。即使流年顺利也要防止由吉变凶，适当外出走动可降低命局的冲战，如果今年计划结婚、生子、合作等和合之事，要特别小心发生突变。/n羊刃，为红伤争执、性急刚猛的标志！凶多吉少，易有红伤破耗，克妻破财的事情发生。/n",
        "shiShenName": "比肩",
        "shiShenText": "流年比肩：交际能力变强，友人增多，与家人感情融洽，工作上积极，同事之间相互帮助，若能更加勇敢处理事情，必然会收获很多，或者会成为一个非常受欢迎的人。"
      },
      {
        "year": "2027火羊年",
        "score": 71,
        "text": "今年是小吉之年，运程基本顺利，环境会给你带来一些帮助，有贵人运，在工作事业方面也容易得到提拔，但自己的努力是绝对不能少的，勤奋付出能得到满意的回报。一些突发情况带来的阻力和困难不可小看，谨防喜事变凶事。",
        "jiShen": "无",
        "xiongShen": "无",
        "shiShenName": "劫财",
        "shiShenText": "流年劫财：务实、独立自强之人，交际能力不错，遇事常有很多朋友相助，财运较旺，若有志于事业亦能战胜困难获得成功。"
      }
    ],
    "isPayed": true,
    "name": "订单号测试",
    "sex": "女",
    "birth": "1990-01-01 00:30:00",
    "maleName": null,
    "femaleName": null,
    "browseNum": 0
  },
  "status": 0,
  "msg": ""
}