// let _filter = [
//   /* 表亲 */
//   { // 表亲的关系
//     exp: /^(.+)&o([^#]+)&l/g,
//     str: '$1$2'
//   },
//   { // 表亲的关系
//     exp: /^(.+)&l([^#]+)&o/g,
//     str: '$1$2'
//   },
//   { // 表亲的关系
//     exp: /(,[ds],(.+),[ds])&[ol]/g,
//     str: '$1'
//   },
//   /* 兄弟姐妹 */
//   { // 哥哥姐姐的哥哥姐姐还是自己的哥哥姐姐(年龄判断)
//     exp: /(,o[sb])+(,o[sb])/,
//     str: '$2'
//   },
//   { // 弟弟妹妹的弟弟妹妹还是自己的弟弟妹妹(年龄判断)
//     exp: /(,l[sb])+(,l[sb])/,
//     str: '$2'
//   },
//   { // 如果自己是男性,兄弟姐妹的兄弟就是自己的兄弟或自己
//     exp: /^(.*)(,[fh1])(,[olx][sb])+,[olx]b(.*)$/,
//     str: '$1$2,xb$4#$1$2$4'
//   },
//   { // 如果自己是女性,兄弟姐妹的姐妹就是自己的姐妹或自己
//     exp: /^(.*)(,[mw0])(,[olx][sb])+,[olx]s(.*)$/,
//     str: '$1$2,xs$4#$1$2$4'
//   },
//   { // 如果自己是男性,兄弟姐妹的姐妹就是自己的姐妹
//     exp: /(,[fh1])(,[olx][sb])+,[olx]s/g,
//     str: '$1,xs'
//   },
//   { // 如果自己是女性,兄弟姐妹的兄弟就是自己的兄弟
//     exp: /(,[mw0])(,[olx][sb])+,[olx]b/g,
//     str: '$1,xb'
//   },
//   { // 不知道性别，兄弟姐妹的兄弟是自己或兄弟
//     exp: /^,[olx][sb],[olx]b(.+)?$/,
//     str: '$1#,xb$1'
//   },
//   { // 不知道性别，兄弟姐妹的姐妹是自己或姐妹
//     exp: /^,[olx][sb],[olx]s(.+)?$/,
//     str: '$1#,xs$1'
//   },
//   { // 将复合称谓拆分
//     exp: /^,x([sb])$/,
//     str: ',o$1#,l$1'
//   },
//   /* 父母 */
//   { // 母亲的丈夫是自己的父亲
//     exp: /m,h/g,
//     str: 'f'
//   },
//   { // 父亲的妻子是自己的母亲
//     exp: /f,w/g,
//     str: 'm'
//   },
//   { // 兄弟的父母就是自己的父母
//     exp: /,[xol][sb](,[mf])/g,
//     str: '$1'
//   },
//   /* 父母的子女 */
//   { // 父母的女儿年龄判断是姐姐还是妹妹
//     exp: /,[mf],d&([ol])/,
//     str: ',$1s'
//   },
//   { // 父母的儿子年龄判断是哥哥还是弟弟
//     exp: /,[mf],s&([ol])/,
//     str: ',$1b'
//   },
//   { // 如果自己是男性,父母的儿子是自己或者兄弟
//     exp: /^(.*)(,[fh1]|[xol]b),[mf],s(.*)$/,
//     str: '$1$2,xb$3#$1$2$3'
//   },
//   { // 如果自己是女性,父母的女儿是自己或者姐妹
//     exp: /^(.*)(,[mw0]|[xol]s),[mf],d(.*)$/,
//     str: '$1$2,xs$3#$1$2$3'
//   },
//   { // 如果自己是女性,父母的儿子是自己兄弟
//     exp: /(,[mw0]|[xol]s),[mf],s/,
//     str: '$1,xb'
//   },
//   { // 如果自己是男性,父母的女儿是自己姐妹
//     exp: /(,[fh1]|[xol]b),[mf],d/,
//     str: '$1,xs'
//   },
//   { // 父母的儿子是自己或兄弟
//     exp: /^,[mf],s(.+)?$/,
//     str: ',1$1#,xb$1'
//   },
//   { // 父母的女儿是自己或者姐妹
//     exp: /^,[mf],d(.+)?$/,
//     str: ',0$1#,xs$1'
//   },
//   /* 孩子 */
//   { // 孩子的姐妹是自己的女儿(年龄判断)
//     exp: /,[ds]&o,ob/g,
//     str: ',s&o'
//   },
//   { // 孩子的姐妹是自己的女儿(年龄判断)
//     exp: /,[ds]&o,os/g,
//     str: ',d&o'
//   },
//   { // 孩子的兄弟是自己的儿子(年龄判断)
//     exp: /,[ds]&l,lb/g,
//     str: ',s&l'
//   },
//   { // 孩子的兄弟是自己的儿子(年龄判断)
//     exp: /,[ds]&l,ls/g,
//     str: ',d&l'
//   },
//   { // 孩子的姐妹是自己的女儿
//     exp: /,[ds](&[ol])?,[olx]s/g,
//     str: ',d'
//   },
//   { // 孩子的兄弟是自己的儿子
//     exp: /,[ds](&[ol])?,[olx]b/g,
//     str: ',s'
//   },
//   /* 夫妻 */
//   { // 自己是女性，女儿或儿子的妈妈是自己
//     exp: /(,[mwd0](&[ol])?|[olx]s),[ds](&[ol])?,m/g,
//     str: '$1'
//   },
//   { // 自己是女性，女儿或儿子的爸爸是自己的丈夫
//     exp: /(,[mwd0](&[ol])?|[olx]s),[ds](&[ol])?,f/g,
//     str: '$1,h'
//   },
//   { // 自己是男性，女儿或儿子的爸爸是自己
//     exp: /(,[fhs1](&[ol])?|[olx]b),[ds](&[ol])?,f/g,
//     str: '$1'
//   },
//   { // 自己是男性，女儿或儿子的妈妈是自己的妻子
//     exp: /(,[fhs1](&[ol])?|[olx]b),[ds](&[ol])?,m/g,
//     str: '$1,w'
//   },
//   { // 不知道性别，子女的妈妈是自己或妻子
//     exp: /^,[ds],m(.+)?$/,
//     str: '$1#,w$1'
//   },
//   { // 不知道性别，子女的爸爸是自己或丈夫
//     exp: /^,[ds],f(.+)?$/,
//     str: '$1#,h$1'
//   },
//   { // 夫妻的孩子就是自己的孩子
//     exp: /,[wh](,[ds])/g,
//     str: '$1'
//   },
//   { // 夫妻的对方是自己
//     exp: /,w,h|,h,w/g,
//     str: ''
//   },
//   { // 并列关系处理
//     exp: /(.+)?\[(.+)\|(.+)\](.+)?/g,
//     str: '$1$2$4#$1$3$4'
//   }
// ]
// export default _filter
